%% function F=Control(y0) %управление u=u(y),y = cA - это стационарная система
function F=Control(t)
global y_0 y_End k b alpha betta N
%--------------------------------------------------------------------------
%--------------------------------------------------------------------------
y0=Euler(t,t/N);

y1=k*y0+b+alpha*(y0-y_0(1))*(y0-y_End(1))+betta*(y0-y_0(1))^2*(y0-y_End(1));

y2=(k+alpha*(y0-y_0(1))+alpha*(y0-y_End(1))+2*betta*(y0-y_0(1))*(y0-y_End(1))+betta*(y0-y_0(1))^2)*y1;

y3=2*(alpha+3*betta*y0-2*betta*y_0(1)-betta*y_End(1))*y1^2+...
    (k+alpha*(y0-y_0(1))+alpha*(y0-y_End(1))+2*betta*(y0-y_0(1))*(y0-y_End(1))+betta*(y0-y_0(1))^2)^2*y1;

y=[y0 y1 y2];
%--------------------------------------------------------------------------
f=fKan(y);
g=gKan(y);
%--------------------------------------------------------------------------
F(1,1)=(y3-f)/g;
F(2,1)=f;
F(3,1)=g;
F(4,1)=y0;
F(5,1)=y1;
F(6,1)=y2;
F(7,1)=y3;